tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'
tap 'b4b4r07/goal'
brew 'goal'

brew 'ack'
brew 'autoconf'
brew 'checkbashisms'
brew 'coreutils'
brew 'cowsay'
brew 'direnv'
brew 'ffmpeg'
brew 'figlet'
brew 'fzf'
brew 'gawk'
brew 'gdbm'
brew 'gifsicle'
brew 'git'
brew 'maven'
brew 'go', args: ['cross-compile-common']
brew 'hub'
brew 'hugo'
brew 'jq'
brew 'lame'
brew 'libevent'
brew 'mercurial'
brew 'nkf'
brew 'openssl'
brew 'peco'
brew 'python'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby-build'
brew 'shellcheck'
brew 'sqlite'
brew 'terminal-notifier'
brew 'tig'
brew 'tree'
brew 'vim', args: ['with-lua', 'with-luajit']
brew 'wget'
brew 'zsh', args: ['disable-etcdir']
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask_args appdir: '/Applications'

# Applications
cask 'intellij-idea'
cask 'iterm2'
cask 'atom'
cask 'sourcetree'
cask 'gas-mask'
cask 'spectacle'
cask 'macdown'
cask 'sequel-pro'


